# GetInnerRule Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterInverseRule..::..GetInnerRule Method
FilterInverseRule Class See Also
---
Gets the rule being inverted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FilterRule GetInnerRule()
```

Visual Basic
---
```text
Public Function GetInnerRule As FilterRule
```

Visual C++
---
```text
public:
FilterRule^ GetInnerRule()
```

# See Also
FilterInverseRule Class
Autodesk.Revit.DB Namespace